// TASK 1
//Создать объект, описывающий автомобиль (производитель, модель, год выпуска, средняя скорость), и следующие функции для работы с этим объектом: Функция для вывода на экран информации об автомобиле; Функция для подсчета необходимого времени для преодоления переданного расстояния со средней скоростью. Учтите, что через каждые 4 часа дороги водителю необходимо делать перерыв на 1 час.

const tsk1Btn = document.querySelector('#l27-tsk1-btn');

tsk1Btn.addEventListener('click', runL27Tsk1);

function runL27Tsk1() {}

//TASK 2
//Создать объект, хранящий в себе отдельно числитель и знаменатель дроби, и следующие функции для работы с этим объектом: Функция сложения 2-х объектов-дробей; Функция вычитания 2-х объектов-дробей; Функция умножения 2-х объектов-дробей; Функция деления 2-х объектов-дробей; Функция сокращения объекта-дроби.

const tsk2Btn = document.querySelector('#l27-tsk2-btn');

tsk2Btn.addEventListener('click', runL27Tsk2);

function runL27Tsk2() {}

//TASK 3
//Создать объект, описывающий время (часы, минуты, секунды), и следующие функции для работы с этим объектом: Функция вывода времени на экран; Функция изменения времени на переданное количество секунд; Функция изменения времени на переданное количество минут; Функция изменения времени на переданное количество часов. Учтите, что в последних 3-х функциях, при изменении одной части времени, может измениться и другая. Например, если ко времени «20:30:45» добавить 30 секунд, то должно получиться «20:31:15», а не «20:30:75».

const tsk3Btn = document.querySelector('#l27-tsk3-btn');

tsk3Btn.addEventListener('click', runL27Tsk3);

function runL27Tsk3() {}
