// TASK 1
//Реализовать класс, описывающий окружность. В классе должны быть следующие компоненты:

// поле, хранящее радиус окружности;
// get-свойство, возвращающее радиус окружности;
// set-свойство, устанавливающее радиус окружности;
// get-свойство, возвращающее диаметр окружности;
// метод, вычисляющий площадь окружности;
// метод, вычисляющий длину окружности.
// Продемонстрировать работу свойств и методов.

const tsk1Btn = document.querySelector('#l29-tsk1-btn');

tsk1Btn.addEventListener('click', runL29Tsk1);

function runL29Tsk1() {}

//TASK 2
//Реализовать класс, описывающий простой маркер. В классе должны быть следующие компоненты:

// поле, которое хранит цвет маркера;
// поле, которое хранит количество чернил в маркере (в процентах);
// метод для печати (метод принимает строку и выводит текст соответствующим цветом; текст выводится до тех пор, пока в маркере есть чернила; один не пробельный символ – это 0,5% чернил в маркере).
// Реализовать класс, описывающий заправляющийся маркер, унаследовав его от простого маркера и добавив метод для заправки маркера.

// Продемонстрировать работу написанных методов.

const tsk2Btn = document.querySelector('#l29-tsk2-btn');

tsk2Btn.addEventListener('click', runL29Tsk2);

function runL29Tsk2() {}

//TASK 3
//Реализовать класс Employee, описывающий работника, и создать массив работников банка.

// Реализовать класс EmpTable для генерации HTML-кода таблицы со списком работников банка. Массив работников необходимо передавать через конструктор, а получать HTML-код с помощью метода getHtml().

// Создать объект класса EmpTable и вывести на экран результат работы метода getHtml().

const tsk3Btn = document.querySelector('#l29-tsk3-btn');

tsk3Btn.addEventListener('click', runL29Tsk3);

function runL29Tsk3() {}
